app/views/events/show.html.haml

SELECT "event_tasks".* FROM "event_tasks" WHERE "event_tasks"."event_id" = ?  [["event_id", 1]]
---
    %tbody
      -@event.event_tasks.each do |event_task|