app/controllers/event_tasks_controller.rb

  def create
    @event_task = @event.event_tasks.new(event_task_params)

    respond_to do |format|
      if @event_task.save
---
INSERT INTO "event_tasks" ("event_id", "title", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["event_id", 1], ["title", "Get present"], ["completed", 0], ["created_at", "2019-12-11 19:05:31.923587"], ["updated_at", "2019-12-11 19:05:31.923587"]]

  def update
    respond_to do |format|
      if @event_task.update(event_task_params)
---
UPDATE "event_tasks" SET "completed" = ?, "updated_at" = ? WHERE "event_tasks"."id" = ?  [["completed", 1], ["updated_at", "2019-12-11 21:02:03.431443"], ["id", 1]]

  def destroy
    @event_task.destroy
---
DELETE FROM "event_tasks" WHERE "event_tasks"."id" = ?  [["id", 3]]

    def set_event_task
      @event_task = EventTask.find(params[:id])
---
SELECT  "event_tasks".* FROM "event_tasks" WHERE "event_tasks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def set_event
      @event = Event.find_by(id: params[:event_id]) || Event.find(event_task_params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]