app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    @event.user = current_user

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("title", "date", "start", "end", "location", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)