app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @task.user = current_user

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("title", "description", "date", "completed", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 1], ["updated_at", "2019-12-13 23:10:03.342212"], ["id", 1]]